class Results {
  static List<Map<String, dynamic>> mbtiResults = [
    {
      "type": "ENFJ",
      "img": "assets/images/ENFJ.png",
      "desc": [
        {
          "desc1": "인류애가 많다.",
          "desc2": "인간관계에서는 진실성이 가장 중요하다.",
          "desc3": "책임감이 강하고 양심적이며 인내심이 강하다.",
          "desc4": "경쟁적인 환경에서는 일하기 힘들어한다.",
        }
      ],
      'description': "ENFJ 유형은 ...",
      'characteristics': [
        "사회적 리더십: ENFJ는 사회적 상황에서 리더 역할을 맡는 데 탁월합니다. 다른 사람들을 이끄고 조직하는 데 능숙하며, 그들의 리더십은 동료들에게 영향을 미칩니다.",
        "친화력: ENFJ는 사람을 좋아하며 다른 사람과 가까운 관계를 형성하는 데 적극적입니다. 다른 사람들과의 관계를 중요시하며 친절하고 환영받는 분위기를 조성합니다.",
        "공감 능력: 다른 사람의 감정과 필요를 이해하고 공감할 수 있는 능력이 강합니다. ENFJ는 다른 사람들의 감정에 민감하게 반응하며 돕는 역할을 합니다.",
        "의지력: ENFJ는 자신의 이상과 가치를 위해 헌신적으로 노력하며, 어려운 일에도 인내와 열정을 가지고 극복합니다.",
        "적응력: ENFJ는 다양한 상황에 빠르게 적응할 수 있는 능력을 가집니다. 변화에 대한 저항이 적고, 새로운 상황에서도 잘 적응합니다.",
        "타인의 성장 지원: ENFJ는 친구와 가족의 성장을 돕는 데 큰 만족을 느낍니다. 다른 사람들이 발전하고 성취하는 데 기여합니다.",
        "자기 희생적 헌신: ENFJ는 타인을 위해 자기를 희생하거나 다른 사람의 이익을 먼저 생각하는 경향이 있습니다. 다른 사람들을 돕는 일을 즐깁니다.",
        "감정적인 영향: ENFJ는 다른 사람의 감정을 받아들이기 쉽습니다. 다른 사람들이 슬플 때는 슬퍼하고, 기뻐할 때는 기뻐합니다.",
        "정의와 원칙: ENFJ는 공정하고 도덕적인 가치를 중요시하며, 사회 정의와 원칙을 존중합니다.",
        "적극적 소통: 말하기와 글쓰기 능력이 뛰어나며, 다른 사람들과의 소통을 즐깁니다. 자신의 생각과 아이디어를 효과적으로 전달합니다.",
        "문제 해결 능력: ENFJ는 복잡한 문제를 해결하고 다른 사람들의 의견을 수렴하여 합리적인 결정을 내릴 수 있습니다.",
        "사회적 관계 중시: ENFJ는 다른 사람들과의 관계를 중요시하며, 주변 사람들과 조화롭게 지내려 노력합니다."
      ],
      'weaknesses': [
        "과도한 헌신: ENFJ는 종종 다른 사람들을 돕고 기쁘게 해주려는 성향이 강할 수 있습니다. 이로 인해 자신의 필요를 무시하거나 과도한 부담을 지게 될 수 있습니다.",
        "과도한 완벽주의: ENFJ는 완벽을 추구하는 경향이 있어, 일의 세부사항에 지나치게 신경을 쓸 수 있습니다. 이로 인해 업무나 프로젝트를 완료하는 데 시간을 지체시킬 수 있습니다.",
        "감정 과민: ENFJ는 다른 사람들의 감정에 민감하게 반응할 수 있으며, 다른 사람이 나쁜 기분일 때 자신도 같이 나쁜 기분이 들 수 있습니다.",
        "자기 희생적 헌신: 너무나 다른 사람을 돕고 지키려는 경향이 있어 자신의 필요를 무시할 수 있습니다. 이로 인해 자기관리가 부족할 수 있습니다.",
        "경계 설정 부족: ENFJ는 종종 '아니'라고 말하기 어려워할 수 있으며, 그 결과 다른 사람들의 요청에 과도하게 수락하는 경향이 있습니다.",
        "감정 표현 어려움: ENFJ는 자신의 감정을 표현하기 어려울 수 있으며, 그로 인해 감정을 억압하거나 숨길 수 있습니다.",
        "스트레스에 취약: ENFJ는 스트레스를 받을 때 자신의 필요를 무시하고 다른 사람들을 위주로 생각하기 쉽습니다. 이로 인해 스트레스 관리에 어려움을 겪을 수 있습니다."
      ],
    },
    {
      "type": "ENFP",
      "img": "assets/images/ENFP.png",
      "desc": [
        {
          "desc1": "사람들에게 관심이 많다.",
          "desc2": "공감 능력이 뛰어나다.",
          "desc3": "싫증을 잘 낸다.",
          "desc4": "재밌게 놀다가도 불현듯 자아성찰을 많이 한다.",
        }
      ],
      'description': "ENFP 유형은 ...",
      'characteristics': [
        "열정적: ENFP는 열정적이며 새로운 아이디어와 프로젝트에 흥미를 가지고, 다른 사람들을 열광적으로 도와줍니다.",
        "창의성: ENFP는 독창적이며, 새로운 관점과 아이디어를 제시하며, 예술과 창작적 활동을 즐깁니다.",
        "연결력: ENFP는 다른 사람들과 가까운 관계를 형성하는 데 능숙하며, 다른 사람의 감정을 이해하고 공감합니다.",
        "유연성: ENFP는 새로운 상황에 빠르게 적응할 수 있으며, 열린 마음으로 다양한 경험을 받아들입니다.",
        "영감: ENFP는 자신과 주변 사람들을 영감으로 가득 채우고, 긍정적인 에너지를 전파합니다.",
      ],
      'weaknesses': [
        "계획 부족: ENFP는 일상적인 계획을 세우기 어려울 수 있으며, 프로젝트를 완료하기 위한 조직적 능력이 부족할 수 있습니다.",
        "결정력 부족: ENFP는 선택을 내리기 어려울 수 있으며, 다양한 가능성 때문에 결정을 미루는 경향이 있습니다.",
        "감정적인 변동: ENFP는 감정적으로 변화무쌍할 수 있으며, 감정적인 안정을 유지하기 어려울 수 있습니다.",
        "비현실적: ENFP는 현실과 무관한 계획을 세울 수 있으며, 현실적인 제약을 무시할 수 있습니다.",
        "비판에 민감: ENFP는 비판에 민감할 수 있으며, 다른 사람들의 의견에 대해 상처를 받을 수 있습니다.",
      ],
    },
    {
      "type": "ENTJ",
      "img": "assets/images/ENTJ.png",
      "desc": [
        {
          "desc1": "도전정신이 있다.",
          "desc2": "생산적이고 유능한 사람을 좋아한다.",
          "desc3": "결과 중심적이다.",
          "desc4": "감정 표현이 솔직하다.",
        }
      ],
      'description': "ENTJ 유형은 ...",
      'characteristics': [
        "리더십: ENTJ는 리더로서 뛰어나며, 타인을 이끄고 조직하는 데 능숙합니다. 목표를 달성하기 위해 대담하게 행동합니다.",
        "논리적 사고: ENTJ는 객관적이며 논리적으로 문제를 해결하는 데 능숙하며, 전략을 세우는 데 뛰어납니다.",
        "목표 지향성: ENTJ는 목표를 설정하고 그 목표를 달성하기 위해 끈질기고 결단력 있게 노력합니다.",
        "효율성: ENTJ는 작업을 효율적으로 수행하고 계획을 실행하는 데 능숙합니다.",
        "의사소통 능력: ENTJ는 탁월한 의사소통 능력을 가지고 있으며, 아이디어를 효과적으로 전달합니다.",
      ],
      'weaknesses': [
        "과연성: ENTJ는 때로 다른 사람들의 의견을 무시하거나 감안하지 않을 수 있으며, 자신의 목표를 추구하는 데 집중할 수 있습니다.",
        "극도의 목표 추구: ENTJ는 목표 달성을 위해 너무나 열정적일 수 있으며, 과도한 업무 부담을 안게 될 수 있습니다.",
        "인내 부족: ENTJ는 인내심이 부족하며, 다른 사람들의 작업 속도나 미흡함에 쉽게 짜증을 낼 수 있습니다.",
        "과도한 비판: ENTJ는 자신과 타인에게 높은 기준을 적용하고, 비판적일 수 있습니다.",
        "작업 중심: ENTJ는 업무에 집중하고 업무 중심일 때 타인의 감정을 간과할 수 있습니다.",
      ],
    },
    {
      "type": "ENTP",
      "img": "assets/images/ENTP.png",
      "desc": [
        {
          "desc1": "관종인데 조용히 살고 싶어 한다.",
          "desc2": "말발과 재치에 자신 있다.",
          "desc3": "지름길을 발견하는 것에 능숙하다.",
          "desc4": "억압당하는 것을 견디지 못한다.",
        }
      ],
      'description': "ENTP 유형은 ...",
      'characteristics': [
        "논리적 사고: ENTP는 논리적으로 문제를 해결하고, 다양한 시나리오와 가능성을 고려하는 데 능숙합니다.",
        "창의성: ENTP는 독창적이며, 새로운 아이디어와 방법을 개발하며, 빠르게 변화하는 환경에서 능동적입니다.",
        "토론의 재능: ENTP는 논쟁과 토론을 즐기며, 다른 사람과 의견을 교환하고 논리적인 논쟁을 펼칩니다.",
        "호기심: ENTP는 지식을 탐구하고 새로운 것을 배우는 데 열정을 가지고 있으며, 다양한 주제에 대해 호기심이 많습니다.",
        "유머 감각: ENTP는 기발하고 날카로운 유머 감각을 가지고 있으며, 주변 사람들을 웃게 만듭니다.",
      ],
      'weaknesses': [
        "포용성 부족: ENTP는 다른 사람의 감정을 고려하지 않고 직설적으로 의견을 표현할 수 있으며, 상처를 줄 수 있습니다.",
        "계획 부족: ENTP는 장기적인 계획을 세우기보다 당면한 문제에 집중하기 쉽고, 프로젝트를 완료하는 데 어려움을 겪을 수 있습니다.",
        "규칙 어기기: ENTP는 규칙을 어길 수 있으며, 권위에 반항하는 경향이 있습니다.",
        "스트레스 관리 어려움: 스트레스를 받을 때 ENTP는 과도한 분석에 빠질 수 있으며, 감정적인 불안을 경험할 수 있습니다.",
        "집중력 부족: ENTP는 관심을 끌지 못하는 것에는 흥미를 잃을 수 있으며, 프로젝트를 완료하기 전에 새로운 아이디어로 넘어갈 수 있습니다.",
      ],
    },
    {
      "type": "ESFJ",
      "img": "assets/images/ESFJ.png",
      "desc": [
        {
          "desc1": "타인에게 인정받고 싶어 한다.",
          "desc2": "남들 챙기는 것을 좋아한다.",
          "desc3": "스포트라이트를 받는 것을 좋아한다.",
          "desc4": "역지사지를 잘한다.",
        }
      ],
      'description': "ESFJ 유형은 ...",
      'characteristics': [
        "사회적: ESFJ는 사교적이고 다른 사람들과 어울리는 것을 즐깁니다. 사람들과의 관계를 중요시하며, 다른 사람들을 돕는 데 탁월합니다.",
        "책임감: ESFJ는 자신의 의무와 책임을 신중하게 다하며, 신뢰성 있는 동료와 친구로 알려져 있습니다.",
        "현실적: ESFJ는 현실적으로 문제를 접근하며, 다른 사람들에게 실질적인 조언을 제공합니다.",
        "감수성: ESFJ는 다른 사람들의 감정을 이해하고 공감하는 데 능숙하며, 다른 사람들을 위로하고 지지합니다.",
        "조직력: ESFJ는 주로 조직적이고 계획적으로 일을 처리하며, 사회적 모임을 조직하는 데 능숙합니다.",
      ],
      'weaknesses': [
        "과도한 우려: ESFJ는 종종 다른 사람들을 위해 너무 걱정하고 과도한 스트레스를 받을 수 있습니다.",
        "자기 희생적 헌신: ESFJ는 자신을 희생하고 과도한 부담을 지기 쉽습니다. 자신의 필요를 배려하지 않을 수 있습니다.",
        "감정적 민감성: ESFJ는 다른 사람들의 감정에 민감하게 반응할 수 있으며, 다른 사람이 나쁜 기분이면 자신도 영향을 받을 수 있습니다.",
        "변화에 대한 저항: ESFJ는 변경을 받아들이기 어려울 수 있으며, 새로운 상황에 적응하는 데 시간이 걸릴 수 있습니다.",
        "비판에 민감: ESFJ는 비판에 예민할 수 있으며, 다른 사람들의 평가에 민감해질 수 있습니다."
      ],
    },
    {
      "type": "ESFP",
      "img": "assets/images/ESFP.png",
      "desc": [
        {
          "desc1": "분위기 메이커다.",
          "desc2": "일을 미루는 경향이 있다.",
          "desc3": "개성적인 매력이 있다.",
          "desc4": "좋아하는 사람과 싫어하는 사람이 분명하다.",
        }
      ],
      'description': "ESFP 유형은 ...",
      'characteristics': [
        "사교적: ESFP는 다른 사람과 어울리는 것을 즐기며, 사회적 상황에서 능숙하게 대화하고 인간관계를 형성합니다.",
        "현실 감각: ESFP는 현재 상황을 중요시하며, 순간을 즐기고 경험 중심으로 삶을 살아갑니다.",
        "융통성: ESFP는 새로운 상황에 빠르게 적응하고, 열린 마음으로 다양한 경험을 받아들입니다.",
        "창의성: ESFP는 창의적이며, 예술, 음악 및 연극과 같은 예술적 활동을 즐깁니다.",
        "긍정적 에너지: ESFP는 긍정적이고 열정적인 에너지를 가지고 있으며, 주변에 밝고 환기시키는 영향을 미칩니다.",
      ],
      'weaknesses': [
        "계획 부족: ESFP는 장기적인 계획을 세우거나 긴 시간 동안의 업무를 관리하는 데 어려움을 겪을 수 있습니다.",
        "충동적: ESFP는 현재의 즉각적인 쾌락에 반응할 수 있으며, 장기적인 결과를 고려하지 않을 수 있습니다.",
        "감정 변동성: ESFP는 감정이 변동적일 수 있으며, 다른 사람들에게 예상치 못한 감정적 변화를 보일 수 있습니다.",
        "비관적인 순간: 어떤 일이 잘못될 때 ESFP는 비관적이고 슬플 수 있으며, 긍정적인 면을 잃을 수 있습니다.",
        "비결과 지향: ESFP는 결과보다는 경험 자체에 더 중점을 둈 수 있으며, 장기적인 목표 달성을 간과할 수 있습니다.",
      ],
    },
    {
      "type": "ESTJ",
      "img": "assets/images/ESTJ.png",
      "desc": [
        {
          "desc1": "뭐든 확실하게 딱 떨어지는 게 좋다.",
          "desc2": "감정 공감보다는 해결책을 내세운다.",
          "desc3": "안정적이고 예측 가능한 상황을 좋아한다.",
          "desc4": "외향형 치고는 상당히 독립적이다.",
        }
      ],
      'description': "ESTJ 유형은 ...",
      'characteristics': [
        "조직력: ESTJ는 잘 구조화된 환경을 선호하며, 계획적이고 조직적으로 일을 처리하는 데 능숙합니다.",
        "책임감: ESTJ는 자신의 의무와 책임을 중요시하며, 다른 사람들에게도 책임감을 고양시킵니다.",
        "현실 감각: ESTJ는 현실적으로 사고하며, 현재의 문제를 해결하고 실제적인 해결책을 찾습니다.",
        "의사소통 능력: ESTJ는 명확하게 의견을 표현하고, 다른 사람들에게 정보를 전달하는 데 탁월한 능력을 가집니다.",
        "신뢰성: ESTJ는 신뢰성 있는 리더와 동료로 인정받는 경향이 있으며, 약속을 지킵니다.",
      ],
      'weaknesses': [
        "고집: ESTJ는 때로 다른 사람들의 의견을 무시하고 자신의 방식대로 일을 처리하는 고집이 강할 수 있습니다.",
        "과도한 집착: ESTJ는 세부사항에 과도하게 집착할 수 있으며, 완벽주의 성향이 강할 수 있습니다.",
        "폐쇄성: ESTJ는 새로운 아이디어나 관점을 받아들이기 어려울 수 있으며, 변화에 대한 저항이 있을 수 있습니다.",
        "업무 중심: ESTJ는 업무와 임무에 집중하고, 종종 사회적인 측면이 부족할 수 있습니다.",
        "과연성: ESTJ는 간혹 타인을 비판하거나 무시할 수 있으며, 자신의 목표를 중시합니다."
      ],
    },
    {
      "type": "ESTP",
      "img": "assets/images/ESTP.png",
      "desc": [
        {
          "desc1": "자기주장이 강하다.",
          "desc2": "현재의 삶을 즐기는 것을 좋아한다.",
          "desc3": "의리 빼면 시체다.",
          "desc4": "잡생각을 잘 하지 않는다.",
        }
      ],
      'description': "ESTP 유형은 ...",
      'characteristics': [
        "모험적: ESTP는 새로운 경험과 모험을 즐기며, 적극적으로 활동하고 위험을 감수합니다.",
        "실용적: ESTP는 문제를 해결하는 데 실용적인 방법을 취하며, 현실적이고 객관적으로 생각합니다.",
        "적응력: ESTP는 다양한 상황에 쉽게 적응하며, 순발력이 있어 즉각적인 대처 능력이 뛰어납니다.",
        "사회적: ESTP는 사교적이며 다른 사람들과의 관계를 중요시하며, 주변 사람들과 잘 어울립니다.",
        "정신적인 민첩성: ESTP는 감각적이고 미래 지향적이며, 기술적 또는 체계적인 문제를 풀기에 능숙합니다.",
      ],
      'weaknesses': [
        "충동적: ESTP는 현재 상황에 반응하여 충동적으로 행동할 수 있으며, 장기적인 계획이 부족할 수 있습니다.",
        "규칙 어기기: ESTP는 규칙을 어길 수 있으며, 권위에 반항하는 경향이 있습니다.",
        "감정 표현 부족: ESTP는 감정을 표현하는 데 어려움을 겪을 수 있으며, 자신의 감정을 내적으로 처리하는 경향이 있습니다.",
        "장기적인 계획 부족: ESTP는 장기적인 목표나 계획을 세우는 것을 피하거나 미룰 수 있습니다.",
        "관대함: ESTP는 때로 다른 사람들의 감정을 과소평가하거나 타인의 필요를 간과할 수 있습니다.",
      ],
    },
    {
      "type": "INFJ",
      "img": "assets/images/INFJ.png",
      "desc": [
        {
          "desc1": "감정적이면서 동시에 이성적이다.",
          "desc2": "목적과 의미가 있는 일에 대해 열정적이다.",
          "desc3": "자아성찰을 자주 하는 편이며, 본인 스스로에게 매우 엄격하다.",
          "desc4": "과거와 현재의 공통점을 찾아 미래를 예측하는 것을 좋아한다.",
        }
      ],
      'description': "INFJ 유형은 ...",
      'characteristics': [
        "비전과 이상주의자: INFJ는 비전을 가지고 미래를 상상하며, 자신과 타인의 성장과 발전을 중요하게 생각합니다.",
        "정신적 탐구: INFJ는 심오하고 내면적인 생각을 즐기며, 자기 인식을 중요시합니다.",
        "공감 능력: INFJ는 타인의 감정을 이해하고 공감할 수 있는 능력이 뛰어나며, 돕는 역할을 합니다.",
        "예술적 성향: INFJ는 창의적이며, 예술과 문학에 관심을 가집니다.",
        "헌신적 리더십: INFJ는 비전을 가지고 다른 사람들을 이끄는데 능숙하며, 헌신적인 리더입니다.",
      ],
      'weaknesses': [
        "과도한 이상주의: INFJ는 현실적인 부분을 무시하거나 미룰 수 있으며, 실제 문제에 대처하기 어려워질 수 있습니다.",
        "감정에 휘둘림: INFJ는 자신과 타인의 감정에 민감하게 반응하며, 감정적으로 힘들어하는 경향이 있습니다.",
        "자기 희생적 헌신: INFJ는 타인을 돕고 지키려는 경향이 강할 수 있으며, 자신의 필요를 무시할 수 있습니다.",
        "경계 설정 부족: INFJ는 종종 '아니'라고 말하기 어려워할 수 있으며, 그 결과 다른 사람들의 요청에 과도하게 수락하는 경향이 있습니다.",
        "스트레스에 민감: INFJ는 스트레스를 받을 때 피로를 느끼며, 자신의 필요를 무시하는 경향이 있습니다.",
      ],
    },
    {
      "type": "INFP",
      "img": "assets/images/INFP.png",
      "desc": [
        {
          "desc2": "타인과 심리적인 거리는 반드시 유지한다.",
          "desc1": "전통(관습), 규칙과 규율을 좋아하지 않는다.",
          "desc3": "자신과 관련된 사람이나 일에 대해 책임감이 강하고 성실하다.",
          "desc4": "조화롭게 살고자 하며 분쟁을 피하기 위해 노력한다.",
        }
      ],
      'description': "INFP 유형은 ...",
      'characteristics': [
        "이상주의자: INFP는 이상적인 세계관을 가지며, 자신의 가치와 신념을 중요하게 여깁니다.",
        "창의성: INFP는 창의적이고 예술적이며, 자신의 감정과 아이디어를 예술 작품으로 표현하는 데 재능을 가집니다.",
        "감정 풍부: INFP는 감정적으로 풍부하고 민감하며, 다른 사람들의 감정을 이해하고 공감합니다.",
        "독립성: INFP는 자신만의 가치관과 독립성을 중요시하며, 일을 혼자서도 수행하는 것을 선호합니다.",
        "헌신적: INFP는 타인을 돕고 세상을 더 나은 곳으로 만들기 위해 노력하는 데 큰 만족을 느낍니다.",
      ],
      'weaknesses': [
        "과도한 이상주의: INFP는 현실적인 부분을 무시하거나 미룰 수 있으며, 과도한 이상주의로 인해 실제 문제에 대처하기 어려워질 수 있습니다.",
        "의욕의 부족: INFP는 감정에 휘둘리기 쉽고, 일을 마무리하는 데 의욕을 잃는 경향이 있습니다.",
        "비판에 민감: INFP는 비판에 민감할 수 있으며, 부정적인 피드백에 상처를 받을 수 있습니다.",
        "의사 결정 어려움: INFP는 결정을 내릴 때 주저하고, 다양한 가능성을 탐구하는 데 너무 많은 시간을 할애할 수 있습니다.",
        "스트레스에 민감: INFP는 스트레스를 받을 때 감정적으로 힘들어하며, 피로에 쉽게 빠질 수 있습니다.",
      ],
    },
    {
      "type": "INTJ",
      "img": "assets/images/INTJ.png",
      "desc": [
        {
          "desc1": "열심히 산다는 소리를 자주 듣는다.",
          "desc2": "감정에 휘둘리는 것을 싫어한다.",
          "desc3": "목표를 달성할 때 큰 행복을 느낀다.",
          "desc4": "모든 것을 혼자 하려는 의지가 강하다.",
        }
      ],
      'description': "INTJ 유형은 ...",
      'characteristics': [
        "논리적 사고: INTJ는 논리적으로 문제를 해결하고 전략을 세우는 데 능숙합니다.",
        "독립성: INTJ는 자주 혼자 일하고 자신만의 공간을 중요시합니다.",
        "목표 지향성: INTJ는 목표를 설정하고 그것을 이루기 위해 노력하며, 결단력이 강합니다.",
        "비전: INTJ는 비전을 가지고 미래를 계획하며, 새로운 아이디어와 프로젝트에 열정적입니다.",
        "자기 자신에 대한 확신: INTJ는 자신의 능력과 지식에 확신을 가지며, 타인의 의견에 영향을 받지 않습니다.",
      ],
      'weaknesses': [
        "감정 표현 부족: INTJ는 자신의 감정을 표현하기 어려워할 수 있으며, 다른 사람들에게 감정적으로 무뎌 보일 수 있습니다.",
        "완벽주의: INTJ는 완벽을 추구하는 경향이 있어, 일의 세부사항에 지나치게 신경을 쓸 수 있습니다.",
        "사회적 관계 어려움: INTJ는 사회적 관계 관리에 어려움을 겪을 수 있으며, 타인의 감정과 요구사항을 이해하기 어려울 수 있습니다.",
        "타인의 의견 무시: INTJ는 자신의 의견과 방식을 중요시하고, 타인의 의견을 무시하거나 고려하지 않을 수 있습니다.",
        "인내 부족: INTJ는 인내심이 부족하고, 다른 사람들의 능력과 표준에 대해 긍정적이지 않을 수 있습니다.",
      ],
    },
    {
      "type": "INTP",
      "img": "assets/images/INTP.png",
      "desc": [
        {
          "desc1": "멍 때리는 걸 좋아한다.",
          "desc2": "엉뚱한 유머감각이 있다.",
          "desc3": "사람 호불호가 확실하다.",
          "desc4": "꼭 필요한 것이 아니면 바로 잊어버린다.",
        }
      ],
      'description': "INTP 유형은 ...",
      'characteristics': [
        "분석적 사고: INTP는 문제를 분석하고 논리적으로 해결하는 것을 좋아합니다. 이론과 개념을 탐구하는 데 열정적입니다.",
        "창의성: INTP는 독창적이며, 새로운 아이디어와 방법을 개발하는 데 능숙합니다.",
        "독립성: INTP는 자율적이고 독립적으로 일하는 것을 선호하며, 자신만의 방식으로 문제를 해결합니다.",
        "지적 탐구: INTP는 지식을 탐구하고 새로운 정보를 습득하는 데 관심이 많습니다. 학습과 학문적 연구를 즐깁니다.",
        "유머 감각: INTP는 풍자와 유머 감각이 뛰어나며, 직설적이고 날카로운 유머를 가질 수 있습니다.",
      ],
      'weaknesses': [
        "사회적 부적응: INTP는 사회적인 규칙이나 예절을 무시하거나 이해하지 못할 수 있으며, 사회적 상황에서 어색할 수 있습니다.",
        "감정 표현 부족: INTP는 자신의 감정을 표현하는 데 어려움을 겪을 수 있으며, 다른 사람들과의 감정적 연결이 부족할 수 있습니다.",
        "결정 장애: INTP는 너무 많은 옵션과 가능성을 고려하여 결정을 내리는 데 어려움을 겪을 수 있으며, 결정을 미루기도 합니다.",
        "스트레스 관리 어려움: 스트레스를 받을 때 INTP는 자신의 감정을 억압하거나 무시하고, 과도한 분석에 빠질 수 있습니다.",
        "실천 미흡: INTP는 이론을 탐구하는 데 열정적이지만, 실제 행동으로 옮기지 않거나 프로젝트를 완료하는 데 어려움을 겪을 수 있습니다.",
      ],
    },
    {
      "type": "ISFJ",
      "img": "assets/images/ISFJ.png",
      "desc": [
        {
          "desc1": "나서는 건 싫은데 관심받는 건 좋다.",
          "desc2": "지나치게 겸손하다.",
          "desc3": "잘난척하는 사람을 못 참는다.",
          "desc4": "착하다는 얘기를 자주 듣는데 자기는 착한지 모른다.",
        }
      ],
      'description': "ISFJ 유형은 ...",
      'characteristics': [
        "성실함: ISFJ는 매우 성실하고 책임감이 강하며, 자신의 의무와 약속을 엄격하게 지킵니다.",
        "현실적: ISFJ는 현실적으로 문제를 접근하고, 구체적으로 계획을 세우며 실행합니다.",
        "친절함: ISFJ는 다른 사람들을 돕고 배려하며, 친절하고 따뜻한 성향을 가집니다.",
        "조직력: ISFJ는 잘 정리된 환경을 선호하며, 계획을 세우고 세부사항을 주의 깊게 다룹니다.",
        "신뢰성: ISFJ는 다른 사람들로부터 신뢰를 받으며, 약속을 지키는 데 자부심을 가집니다.",
      ],
      'weaknesses': [
        "과도한 자기 희생: ISFJ는 종종 자신을 희생하거나 과도한 부담을 질 수 있으며, 자기의 필요를 무시할 수 있습니다.",
        "감정 표현 부족: ISFJ는 감정을 표현하는 데 어려움을 겪을 수 있으며, 본인의 감정을 솔직하게 나타내기 어려울 수 있습니다.",
        "변화에 대한 저항: ISFJ는 변화를 받아들이기 어려워하고, 새로운 상황에 적응하는 데 어려움을 겪을 수 있습니다.",
        "자기 비판: ISFJ는 자기에 대해 지나치게 비판적일 수 있으며, 완벽주의적인 경향이 있습니다.",
        "과도한 신뢰: ISFJ는 종종 다른 사람들을 믿고 의지하며, 실망을 경험할 수 있습니다.",
      ],
    },
    {
      "type": "ISFP",
      "img": "assets/images/ISFP.png",
      "desc": [
        {
          "desc1": "다른 사람의 부탁을 거절하기 어려워한다.",
          "desc2": "자신의 행동에 대해 자아성찰을 자주 한다.",
          "desc3": "개인 프라이버시를 존중 받기를 바란다.",
          "desc4": "유연한 사고 방식과 개방적인 태도를 지니고 있다.",
        }
      ],
      'description': "ISFP 유형은 ...",
      'characteristics': [
        "예술적 감각: ISFP는 예술과 창의성에 관심이 많으며, 자신의 감정과 아이디어를 예술적으로 표현합니다.",
        "자유로운 영혼: ISFP는 독립적이며 자유로운 환경에서 가장 효과적으로 창조적이고 활동적입니다.",
        "감정 표현: ISFP는 자신의 감정을 표현하는 데 능숙하며, 다른 사람들과 솔직한 감정적 연결을 형성합니다.",
        "실용적: ISFP는 현실적이고 실용적인 성향을 가지며, 문제 해결에 참신한 관점을 제시할 수 있습니다.",
        "민감함: ISFP는 주변 환경에 민감하게 반응하며, 자연과 인간 관계에 대한 깊은 관심을 가집니다.",
      ],
      'weaknesses': [
        "과도한 감정: ISFP는 감정에 휘둘리기 쉽고, 과도한 감정 변동을 경험할 수 있습니다.",
        "계획 부족: ISFP는 장기적인 계획을 세우기 어려워하고, 즉흥적으로 행동하는 경향이 있습니다.",
        "강한 자아 중심: ISFP는 자기 신념과 가치에 대해 강하게 고수하기 쉽고, 다른 사람들의 의견을 거부할 수 있습니다.",
        "비판에 민감: ISFP는 비판에 민감할 수 있으며, 상처를 받기 쉬운 편입니다.",
        "불안: ISFP는 미래에 대한 불안을 느낄 수 있고, 미래에 대한 계획을 세우는 것을 피할 수 있습니다.",
      ],
    },
    {
      "type": "ISTJ",
      "img": "assets/images/ISTJ.png",
      "desc": [
        {
          "desc1": "계획이 틀어지면 스트레스를 엄청 받는다.",
          "desc2": "극도의 효율을 추구한다.",
          "desc3": "주위에서 자꾸 무슨 생각 하냐고 묻는다.",
          "desc4": "사기 안 당할 것 같은 mbti 1순위.",
        }
      ],
      'description': "ISTJ 유형은 ...",
      'characteristics': [
        "책임감: ISTJ는 자신의 의무와 책임을 엄격하게 준수하며, 다른 사람들에게 신뢰를 받습니다.",
        "조직력: ISTJ는 계획을 세우고 구체적으로 실행하는 데 능숙하며, 일의 세부사항을 잘 다룹니다.",
        "신뢰성: ISTJ는 신뢰할 수 있는 친구와 동료로 평가되며, 약속을 지키는 데 자부심을 가집니다.",
        "현실주의: ISTJ는 현실적으로 문제를 접근하고, 객관적으로 판단합니다.",
        "인내력: 어려운 상황에서도 인내와 끈기를 가지고 문제를 해결하며, 꾸준함을 유지합니다.",
      ],
      'weaknesses': [
        "변화에 대한 저항: ISTJ는 변화를 받아들이기 어려워하고, 새로운 상황에 적응하는 데 어려움을 겪을 수 있습니다.",
        "과도한 보수성: ISTJ는 전통과 규칙을 과도하게 중요시할 수 있으며, 새로운 아이디어나 방식을 거부할 수 있습니다.",
        "감정 표현 부족: ISTJ는 감정을 표현하는 데 어려움을 겪을 수 있으며, 감정적으로 연결하는 것이 어려울 수 있습니다.",
        "과도한 비판성: ISTJ는 자기와 다른 사람에게 지나치게 비판적일 수 있으며, 타인에 대한 너그러움이 부족할 수 있습니다.",
        "성격 유형 고집: ISTJ는 자신의 방식이 항상 옳다고 생각할 수 있으며, 타인의 의견을 듣기 어려울 수 있습니다.",
      ],
    },
    {
      "type": "ISTP",
      "img": "assets/images/ISTP.png",
      "desc": [
        {
          "desc1": "자신의 감정을 무시할 때가 있다.",
          "desc2": "모든 것을 혼자 처리하려 한다.",
          "desc3": "생각은 적극적인데 행동은 소극적이다.",
          "desc4": "관심분야가 아니면 쳐다보지도 않는다.",
        }
      ],
      'description': "ISTP 유형은 ...",
      'characteristics': [
        "손재주가 뛰어남: ISTP는 다양한 기술과 손재주에 능통하며, 수리 능력이 뛰어나는 편입니다.",
        "참여형: ISTP는 행동 지향적이며, 문제 상황에 직접 참여하고 솔루션을 찾는 것을 선호합니다.",
        "냉철한 판단력: ISTP는 객관적이고 논리적으로 사고하며, 감정에 휘둘리지 않습니다.",
        "독립성: ISTP는 자주 혼자 일하고 자유롭게 움직이는 것을 좋아합니다.",
      ],
      'weaknesses': [
        "충동적: ISTP는 현재 상황에 반응하여 충동적으로 행동할 수 있으며, 장기적인 계획이 부족할 수 있습니다.",
        "감정 표현 부족: ISTP는 감정을 표현하는 데 어려움을 겪을 수 있고, 다른 사람들과의 감정적 연결이 부족할 수 있습니다.",
        "규칙 어기기: ISTP는 규칙을 어길 수 있으며, 권위에 반항하는 경향이 있습니다.",
        "타인의 감정 무시: ISTP는 종종 다른 사람의 감정을 무시하거나 이해하지 못할 수 있습니다.",
        "계획 부족: ISTP는 장기적인 목표나 계획을 세우는 것을 피하거나 미룰 수 있습니다.",
      ],
    },
  ];
}
